Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: What you really want to see are the changes added to the topic branch — the work you’ll introduce if you merge this branch with master.
cs: To, co chcete vidět ve skutečnosti, jsou změny přidané do tematické větve, práci, kterou provedete začleněním této větve do větve hlavní.

source: When Git merges, it looks at what it has to merge together and then chooses an appropriate merging strategy to use.
cs: Git se vždy při slučování nejprve podívá, co a kam začleňuje, a podle toho zvolí vhodnou strategii začlenění.

source: When Git packs objects, it looks for files that are named and sized similarly, and stores just the deltas from one version of the file to the next.
cs: Při balení objektů vyhledá Git soubory, které mají podobný název a podobnou velikost, a uloží pouze rozdíly mezi jednotlivými verzemi souboru.

source: When a topic branch has finally been merged into `master`, it’s removed from the repository.
cs: Byla-li tematická větev konečně začleněna do větve `master`, může být odstraněna z repozitáře.

source: When all the patches for your topic are applied and committed into your branch, you can choose whether and how to integrate them into a longer-running branch.
cs: Až budete mít všechny záplaty aplikovány a zapsány do tematické větve, můžete se rozhodnout, zda a jak je chcete integrovat do některé z trvalejších větví.

source: When all the work in your topic branch is ready to be integrated into a more mainline branch, the question is how to do it.
cs: Když už je práce v tematické větvi připravena a může být integrována do některé z významnějších větví, vyvstává otázka, jak to provést.

source: When it’s determined that they’re totally stable, the topics are re-merged into `master` and are then rebuilt from the topics that were in `next` but didn’t yet graduate to `master`.
cs: Pokud se ukáže, že jsou tyto tematické větve naprosto stabilní, budou začleněny do větve `master` a poté budou znovu sestaveny z tematických větví, které byly ve větvi `next`, ale ještě se nedostaly do větve `master`.

source: When new work is introduced by contributors, it’s collected into topic branches in the maintainer’s repository in a manner similar to what I’ve described (see Figure 5-24).
cs: Pokud přispěvatelé vytvoří novou práci, je shromažďována v tematických větvích v repozitáři správce podobným způsobem, jaký už jsem popisoval (viz obrázek 5-24).

source: When other developers try to run `git submodule update`, the submodule system can’t find the commit that is referenced, because it exists only on the first developer’s system.
cs: Když se pak ostatní vývojáři pokusí spustit příkaz `git submodule update`, systém submodulu nemůže najít revizi, k níž se vztahuje jedna z referencí, protože existuje pouze v prvním systému vývojáře.

source: When other users visit this project page, they won’t see that URL—only the public one.
cs: Navštíví-li tuto stránku projektu ostatní uživatelé, tuto adresu URL neuvidí, zobrazí se jim pouze veřejná adresa.

source: When people visit your project, they see this page.
cs: Navštíví-li váš projekt ostatní uživatelé, tuto stránku uvidí.

source: When someone else clones that work, all they see is the merge commit with all the work squashed into it; they don’t see the commit data about where it came from or when it was committed.
cs: Pokud tuto práci naklonuje jiný uživatel, uvidí jen jednu revizi vzniklou sloučením, obsahující všechnu práci skomprimovanou do ní. Neuvidí data revizí s informacemi, odkud revize pochází nebo kdy byla zapsána.

source: When that is committed and pushed up, your running daemon should start serving requests for the project to anyone who has access to port 9418 on your server.
cs: Po zapsání a odeslání této revize by měl váš spuštěný démon začít obsluhovat požadavky k projektu pro všechny, kdo mají přístup k portu 9418 na vašem serveru.

source: When that is done, click the "Create Repository" button.
cs: Poté klikněte na tlačítko „Create Repository“ (Vytvořit repozitář).

source: When that is set up, you can use `git imap-send` to place the patch series in the Drafts folder of the specified IMAP server:
cs: Až toto nastavení dokončíte, můžete použít příkaz `git imap-send`, jímž umístíte sérii záplat (patch) do složky Koncepty (Drafts) zadaného serveru IMAP:

source: When that value is set, Git colors its output if the output goes to a terminal.
cs: Je-li tato hodnota nastavena, Git barevně zvýrazní výstup přicházející na terminál.

source: When using `git log` without specifying time, the time defaults to the time at which the command is run on your computer (keeping the identical offset from UTC).
cs: Pokud použijete příkaz `git log` bez určení času, uvažuje se čas odpovídající okamžiku spuštění na vašem počítači (používá stejný posun vůči UTC).

source: When you `dcommit`, you see output like this:
cs: Výstup příkazu `dcommit` bude nyní vypadat následovně:

source: When you clone a repository, it generally automatically creates a `master` branch that tracks `origin/master`.
cs: Pokud klonujete repozitář, většinou se vytvoří větev `master`, která bude sledovat větev `origin/master`.

source: When you commit in Git, Git stores a commit object that contains a pointer to the snapshot of the content you staged, the author and message metadata, and zero or more pointers to the commit or commits that were the direct parents of this commit: zero parents for the first commit, one parent for a normal commit, and multiple parents for a commit that results from a merge of two or more branches.
cs: Zapíšete-li v systému Git revizi, Git uloží objekt revize, obsahující ukazatel na snímek obsahu, který jste určili k zapsání, metadata o autorovi a zprávě a nula nebo více ukazatelů na revizi nebo revize, které byly přímými rodiči této revize: žádné rodiče nemá první revize, jednoho rodiče má běžná revize a několik rodičů mají revize, které vznikly sloučením ze dvou či více větví.

source: When you commit, it looks like you have all the Rack files under that subdirectory — as though you copied them in from a tarball.
cs: Až zapíšete revizi, bude to vypadat, jako byste měli všechny soubory Rack v tomto podadresáři, jako byste je zkopírovali z tarballu.

source: When you commit, you see something like this:
cs: Jestliže zapíšete revizi, zobrazí se přibližně toto:

source: When you design these filters, they should be able to fail gracefully and have the project still work properly.
cs: Při navrhování těchto filtrů byste tedy měli myslet i na to, aby projekt pracoval správně, i když filtr selže.

source: When you do actions in Git, nearly all of them only add data to the Git database.
cs: Jednotlivé operace ve většině případů jednoduše přidávají data do Git databáze.

source: When you do the submodule update a second time, it will still revert your work, but at least you have a pointer to get back to.
cs: Až budete podruhé provádět příkaz submodule update, i tentokrát sice vrátí vaši práci, ale přinejmenším budete mít ukazatel, k němuž se budete moci vrátit.

source: When you download data, the `fetch-pack` and `upload-pack` processes are involved.
cs: Do stahování dat se zapojují procesy `fetch-pack` a `upload-pack`.

source: When you find the correct user, click the Add button to add that user as a collaborator on your project (see Figure 4-11).
cs: Poté, co najdete správného uživatele, klikněte na tlačítko „Add“. Tím uživatele přidáte jako spolupracovníka na svém projektu (viz obrázek 4-11).

source: When you first clone a repository, all of your files will be tracked and unmodified because you just checked them out and haven’t edited anything.
cs: Po úvodním klonování repozitáře budou všechny vaše soubory sledované a nezměněné, protože jste právě provedli jejich checkout a dosud jste neudělali žádné změny.

source: When you have a Git repository locally, add GitHub as a remote and push up your master branch:
cs: Pokud už máte lokální repozitář Git, přidejte GitHub jako vzdálený server a odešlete na něj svou hlavní větev:

source: When you have all the necessary dependencies, you can go ahead and grab the latest snapshot from the Git web site:
cs: Po doinstalování všech potřebných závislostí můžete pokračovat stažením nejnovější verze z webových stránek systému Git:

source: When you have hundreds of users, it’s much more of a pain to manage that process.
cs: Musíte-li spravovat stovky uživatelů, je tento proces příliš náročný.

source: When you have work in a topic branch and have determined that you want to integrate it, you move to that branch and run the rebase command to rebuild the changes on top of your current master (or `develop`, and so on) branch.
cs: Máte-li určitou práci v tematické větvi a rozhodli jste se, že ji integrujete, přejdete na tuto větev a spustíte příkaz rebase, jímž znovu sestavíte příslušné změny na vrcholu svojí aktuální hlavní větve (příp. větve `develop` apod.).

source: When you have work in a topic branch that you’ve done or that someone has contributed and you’ve verified, you merge it into your master branch, delete the topic branch, and then continue the process.
cs: Máte-li v tematické větvi práci, kterou jste vytvořili nebo kterou vám někdo doručil a vy jste ji schválili, začleníte ji do své hlavní větve, smažete tematickou větev a proces může pokračovat.

source: When you have your project at a point that you want to share, you have to push it upstream.
cs: Pokud se váš projekt nachází ve stavu, kdy ho chcete sdílet s ostatními, můžete ho odeslat (push) na referenční server (upstream).

source: When you land on a project page that looks interesting and you want to hack on it a bit, you can click the "fork" button in the project header to have GitHub copy that project to your user so you can push to it.
cs: Pokud se dostanete na zajímavou stránku projektu a chtěli byste se do projektu zapojit, můžete kliknout na tlačítko „fork“ (rozštěpit -- doslova vidlička) v záhlaví projektu a GitHub vytvoří kopii projektu pro vašeho uživatele. Do ní pak můžete odesílat revize.

source: When you make changes and commit in that subdirectory, the superproject notices that the HEAD there has changed and records the exact commit you’re currently working off of; that way, when others clone this project, they can re-create the environment exactly.
cs: Provedete-li v tomto podadresáři změny a zapíšete revizi, superprojekt (tedy celkový, nadřízený projekt) zjistí, že se ukazatel HEAD (podřízeného) projektu změnil, a zaznamená přesnou revizi, na níž právě pracujete. Pokud pak tento projekt naklonují jiní uživatelé, budou schopni přesně obnovit původní prostředí.

source: When you notice issues, you should be able to easily figure out what commit introduced them, when, and by whom.
cs: Vyskytnou-li se jakékoli problémy, měli byste být schopni snadno odhalit závadnou revizi, kdo je jejím autorem a kdy byla zapsána.

source: When you rebase stuff, you’re abandoning existing commits and creating new ones that are similar but different.
cs: Při přeskládání dat zahodíte existující revize a vytvoříte nové, které jsou jim podobné, ale přesto jiné.

source: When you receive such a project, you get the directories that contain submodules, but none of the files yet:
cs: Pokud takový projekt obdržíte, získáte adresáře, které tyto submoduly obsahují, ale zatím žádný soubor:

source: When you restart Apache, you should be able to clone your repositories under that directory by specifying the URL for your project:
cs: Po restartování serveru Apache byste měli být schopni naklonovat své repozitáře v tomto adresáři. Zadejte adresu URL svého projektu:

source: When you restart your machine, your Git daemon will start automatically and respawn if it goes down.
cs: Při restartování počítače se démon Git spustí automaticky. V případě pádu démona bude jeho činnost automaticky obnovena.

source: When you run `git archive`, the contents of that file when people open the archive file will look like this:
cs: Spustíte-li příkaz `git archive`, bude po otevření soubor archivu vypadat obsah tohoto souboru takto:

source: When you run `git commit`, it creates the commit object, specifying the parent of that commit object to be whatever SHA-1 value the reference in HEAD points to.
cs: Spustíte-li příkaz `git commit`, systém vytvoří objekt revize, jehož rodičem bude hodnota SHA-1, na niž ukazuje reference v souboru HEAD.

source: When you run `git init` in a new or existing directory, Git creates the `.git` directory, which is where almost everything that Git stores and manipulates is located.
cs: Spustíte-li v novém nebo existujícím adresáři příkaz `git init`, Git vytvoří adresář `.git`, tj. místo, kde je umístěno téměř vše, co Git ukládá a s čím manipuluje.

source: When you run `git log` in this project, you should get output that looks something like this:
cs: Po zadání příkazu `git log` v tomto projektu byste měli dostat výstup, který vypadá zhruba takto:

source: When you run `git submodule update`, it checks out the specific version of the project, but not within a branch.
cs: Spustíte-li příkaz `git submodule update`, provedete tím checkout konkrétní verze projektu, avšak nikoli v rámci větve.

source: When you run commands like `git branch (branchname)`, Git basically runs that `update-ref` command to add the SHA-1 of the last commit of the branch you’re on into whatever new reference you want to create.
cs: Spouštíte-li příkaz typu `git branch (název větve)`, Git ve skutečnosti spustí příkaz `update-ref` a vloží hodnotu SHA-1 poslední revize větve, na níž se nacházíte, do nové reference, kterou chcete vytvořit.

source: When you save and close the editor, the editor writes a new commit containing that message and makes it your new last commit.
cs: Po uložení změn a zavření editoru zapíše editor novou revizi, která bude obsahovat upravenou zprávu a která bude vaší novou poslední revizí.

source: When you save and exit the editor, Git applies all three changes and then puts you back into the editor to merge the three commit messages:
cs: Po uložení změn a zavření editoru aplikuje Git všechny tři změny a znovu otevře textový editor, abyste sloučili všechny zprávy k revizím:

source: When you save and exit the editor, Git rewinds to the parent of the first commit in your list, applies the first commit (`f7f3f6d`), applies the second (`310154e`), and drops you to the console.
cs: Když uložíte změny a zavřete editor, Git se vrátí na rodiče první revize ve vašem seznamu, aplikuje první revizi (`f7f3f6d`), aplikuje druhou revizi (`310154e`) a ocitnete se znovu na konzoli.

source: When you save and exit the editor, Git rewinds you back to the last commit in that list and drops you on the command line with the following message:
cs: Po uložení změn a zavření editoru vás Git vrátí zpět na poslední revizi v seznamu a zobrazí vám příkazový řádek s touto zprávou:

source: When you save and exit the editor, Git rewinds your branch to the parent of these commits, applies `310154e` and then `f7f3f6d`, and then stops.
cs: Jakmile uložíte změny a zavřete editor, Git vrátí vaši větev zpět na rodiče těchto revizí, aplikuje revizi `310154e`, po ní revizi `f7f3f6d` a zastaví.

source: When you save that, you have a single commit that introduces the changes of all three previous commits.
cs: Po uložení zprávy budete mít jedinou revizi, která bude obsahovat všechny změny předchozích tří revizí.

source: When you specify a subtree merge, Git is smart enough to figure out that one is a subtree of the other and merge appropriately — it’s pretty amazing.
cs: Pokud určíte strategii začlenění podstromu, je Git natolik inteligentní, aby zjistil, že je jeden podstromem druhého, a provedl sloučení odpovídajícím způsobem – počíná si opravdu sofistikovaně.

source: When you want to share a branch with the world, you need to push it up to a remote that you have write access to.
cs: Chcete-li svou větev sdílet s okolním světem, musíte ji odeslat na vzdálený server, k němuž máte oprávnění pro zápis.

source: When you want to share that work, you merge it into your own `master` branch, then fetch and merge `origin/master` if it has changed, and finally push to the `master` branch on the server.
cs: Chcete-li tuto práci sdílet, začleníte ji do své větve `master`. Poté vyzvednete (fetch) a začleníte (merge) větev `origin/master`, jestliže se změnila. Nakonec odešlete všechna data do větve `master` na serveru.

source: When your branch work is finished and you’re ready to contribute it back to the maintainers, go to the original project page and click the "Fork" button, creating your own writable fork of the project.
cs: Až budete s prací ve větvi hotovi a budete ji chtít poslat zpět správcům, přejděte na původní stránku projektu a klikněte na tlačítko „Fork“, jímž vytvoříte vlastní odštěpenou větev projektu, do níž budete moci zapisovat.

source: When your work has been pushed up to your fork, you need to notify the maintainer.
cs: Až svou práci odešlete do odštěpené větve, budete na ni muset upozornit správce.

source: When you’re applying patches, you can ask Git to warn you if it’s applying patches with the specified whitespace issues:
cs: Jestliže aplikujete záplaty, můžete Git požádat, aby vás varoval, pokud je aplikována záplata s některým ze specifikovaných problémů:

source: When you’re branching and merging, everything is being done only in your Git repository — no server communication is happening.
cs: Veškeré větvení a slučování se odehrává pouze v repozitáři Git, neprobíhá žádná komunikace se serverem.

source: When you’re cloning a normal Git repository, you get all the branches on that remote server available locally as something like `origin/[branch]` - namespaced by the name of the remote.
cs: Jestliže klonujete normální repozitář Git, získáte ze vzdáleného serveru všechny větve, lokálně dostupné pod označením `origin/[větev]` – jmenný prostor je dán jménem vzdáleného serveru.

source: When you’re done and want to shut down the server, you can run the same command with the `--stop` option:
cs: Až skončíte a budete chtít server vypnout, spusťte stejný příkaz s parametrem `--stop`:

source: When you’re finished adding collaborators, you should see a list of them in the Repository Collaborators box (see Figure 4-12).
cs: Po přidání všech spolupracovníků byste měli vidět jejich seznam v poli „Repository Collaborators“ (viz obrázek 4-12).

source: When you’re finished, you should run `git bisect reset` to reset your HEAD to where you were before you started, or you’ll end up in a weird state:
cs: Až vyhledávání dokončíte, měli byste použít příkaz `git bisect reset`, abyste vrátili ukazatel HEAD na pozici, z níž jste vyhledávání zahajovali. Jinak byste skončili v nějakém podivném stavu:

source: When you’re thinking of integrating new work, it’s generally a good idea to try it out in a topic branch — a temporary branch specifically made to try out that new work.
cs: Pokud uvažujete o integraci nové práce do projektu, je většinou dobré zkusit si to v tematické větvi, tj. dočasné větvi, kterou vytvoříte konkrétně pro tento účel.

source: When you’re using Git more heavily, however, you may see much more information from `git remote show`:
cs: Pokud však Git používáte na intenzivněji, může vám příkaz `git remote show` zobrazit mnohem více informací:

source: When you’ve become comfortable with a Git workflow, you’ll likely create topic branches, do work on them, and then merge them in.
cs: Jakmile pracovní postupy v systému Git zvládnete, začnete pravděpodobně vytvářet tematické větve, budete v nich pracovat a potom je budete začleňovat (merge).

source: When you’ve decided to cut a release, you’ll probably want to drop a tag so you can re-create that release at any point going forward.
cs: Až se rozhodnete vydat určitou verzi, pravděpodobně ji budete chtít označit značkou, abyste mohli toto vydání v kterémkoli okamžiku v budoucnosti obnovit.

source: Whenever you make changes to the `gitosis-admin` project, you have to commit the changes and push them back up to the server in order for them to take effect:
cs: Pokaždé, když provedete změny v projektu `gitosis-admin`, musíte tyto změny zapsat a odeslat je zpět na server, aby nabyly účinnosti:

source: Whether you maintain a canonical repository or want to help by verifying or approving patches, you need to know how to accept work in a way that is clearest for other contributors and sustainable by you over the long run.
cs: Ať spravujete standardní repozitář, nebo pomáháte při ověřování či schvalování záplat, budete muset vědět, jak přijímat práci ostatních přispěvatelů, a to způsobem, který je pro ostatní co nejčistší a pro vás dlouhodobě udržitelný.

source: While she waits for feedback from John, Jessica decides to start working on `featureB` with Josie.
cs: Zatímco čeká na zpětnou vazbu od Johna, rozhodne se, že začne pracovat spolu s Josie na úkolu `featureB`.

source: While the default, quick, install works for most people, there are some ways to customise the install if you need to.
cs: Základní rychlá metoda instalace bude většině lidí vyhovovat. V případě potřeby existují další možnosti přizpůsobení.

source: Why is it so special?
cs: V čem je jeho větvení tak zvláštní?

source: With Git, you don’t have to deploy your fix along with the `iss53` changes you’ve made, and you don’t have to put a lot of effort into reverting those changes before you can work on applying your fix to what is in production.
cs: Jelikož pracujete v systému Git, nemusíte svou opravu vytvářet uprostřed změn, které jste provedli v části `iss53`, ani nemusíte dělat zbytečnou práci, abyste všechny tyto změny vrátili, než budete moci začít pracovat na opravě produkční verze stránek.

source: With the `rebase` command, you can take all the changes that were committed on one branch and replay them on another one.
cs: Příkazem `rebase` vezmete všechny změny, které byly zapsány na jedné větvi, a necháte je znovu provést na jiné větvi.

source: With the interactive rebase tool, you can then stop after each commit you want to modify and change the message, add files, or do whatever you wish.
cs: S interaktivním nástrojem přeskládání pak můžete zastavit po každé revizi, kterou chcete upravit, a změnit u ní zprávu, přidat soubory nebo cokoli dalšího.

source: With these basic commands, you can use the interactive add mode to deal with your staging area a little more easily.
cs: Pomocí těchto základních příkazů můžete použít režim interaktivního přidávání, a snáze tak ovládat svou oblast připravených změn.

source: With these tools, it’s easy to get Git to work exactly the way you, your company, or your group needs it to.
cs: Pomocí těchto nástrojů lze systém Git snadno nastavit přesně tak, jak potřebujete vy, vaše společnost nebo vaše skupina.

source: With these tools, you can much more easily let Git know what commit or commits you want to inspect.
cs: Pomocí těchto nástrojů můžete v systému Git daleko snáze specifikovat, kterou revizi nebo které revize chcete zobrazit.

source: With this method, you can quickly get a read/write Git server up and running for a handful of developers.
cs: Tímto způsobem lze rychle vytvořit a spustit server Git ke čtení i zápisu pro menší počet vývojářů.

source: Without the `-3` option, it looks like a conflict.
cs: Bez parametru `-3` se celá situace tváří jako konflikt.

source: Word diff format is quite useless when applied to source code, but it comes in handy when applied to large text files, like books or your dissertation.
cs: Zjišťování rozdílů po slovech je u zdrojového kódu celkem k ničemu, ale pokud porovnáváme velké textové soubory -- jako například knihy nebo vaši disertační práci --, pak se tato možnost hodí.

source: Working directory, staging area, and Git directory.
cs: Pracovní adresář, oblast připravených změn a adresář Git
